src/Documents/ИС_ЯМ_УпаковкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_ЯМ_УпаковкаТоваров</Name>
			<Comment>ИнфоСофт Власова И.С. 22.03.24 УА #71520</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПечатиЭтикеток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикеткаРаспечатана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СтатусыСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СтатусыСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ЯМ_СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>substatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ЯМ_ДетальныеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ДанныеВыгрузкиКИЗов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ДанныеВыгрузкиКИЗов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВыгруженныхТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказМП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_АЛИ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_Сбер_Отправление</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_ЯМ_СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ЯМ_СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CANCELLED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERY</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PICKUP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PROCESSING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UNPAID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PLACING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RESERVED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REJECTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PARTIALLY_RETURNED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RETURNED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CANCELLED_WITHOUT_REFUND</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UNKNOWN</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_ЯМ_ДетальныеСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ЯМ_ДетальныеСтатусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>STARTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>READY_TO_SHIP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PROCESSING_EXPIRED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REPLACING_ORDER</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RESERVATION_EXPIRED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SHOP_FAILED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_CHANGED_MIND</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_NOT_PAID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_REFUSED_DELIVERY</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_REFUSED_PRODUCT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_REFUSED_QUALITY</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USER_UNREACHABLE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SHIPPED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ШтрихкодыУпаковокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыУпаковокТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗначениеШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_ЯМ_УпаковкаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы   

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.Свойство("Профиль") Тогда	
			Объект.Профиль = Параметры.Профиль;
		КонецЕсли;
		
		МассивЗаказов = Новый Массив;
		
		Если Параметры.Свойство("ВыделенныеСтроки") Тогда
			МассивЗаказов = Параметры.ВыделенныеСтроки;
		КонецЕсли;
		
		ЗаполнитьДанныеЗаказаНаСервере(МассивЗаказов);
		
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		
	Иначе		
		ЗаполнитьДеревоНоменклатурыПоТЧ();	
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Дерево = ДеревоЗаказы.ПолучитьЭлементы();
	
	Для Каждого Строка Из Дерево Цикл
		Если Строка.ЭтикеткаРаспечатана Тогда
			Элементы.ДеревоЗаказы.Свернуть(Строка.ПолучитьИдентификатор());
		Иначе	
			Элементы.ДеревоЗаказы.Развернуть(Строка.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Отказ Тогда
		
		ТекущийОбъект.Товары.Очистить();
		
		Дерево = РеквизитФормыВЗначение("ДеревоЗаказы");
		ПреобразоватьДеревоВТаблицуЗначений(Дерево, ТекущийОбъект);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			СтруктураШтрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			ОбработатьШтрихкоды(СтруктураШтрихкод.Штрихкод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ЗаполнитьДанныеЗаказа();
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

#КонецОбласти 

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВвестиШтрихкодВручную(Команда)

	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336	
	//ШтрихкодированиеИСКлиент.ПоказатьВводШтрихкода(Оповещение);
	ИС_MP_МаркировкаКлиент.ПоказатьВводШтрихкода(Оповещение);
	//- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура Подключаемый_ОткрытьФормуУточненияДанных() Экспорт		
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка штрихкода завершилось с ошибкой! Данные не найдены по штрихкоду!");
	Возврат;		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997     

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Функция ОписаниеОповещенияОбработкиКодаМаркировки()	
	Возврат Новый ОписаниеОповещения("ОбработатьШтрихкодыЗавершение", ЭтотОбъект);	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкодыЗавершение(Результат, Параметры) Экспорт 	
	ВыполнитьПроверкуНаПечать(Результат);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкоды(Штрихкод)
	
	ОчиститьСообщения();
	
	ДанныеШтрихкода = Новый Структура; 
	
	ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
	ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Штрихкод));
	ДанныеШтрихкода.Вставить("Количество", 1);
	
	//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381	
	ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
	
	ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
	
	//+ ИнфоСофт Заварин К.В. 13.03.25 УА #96054
	ПараметрыСканирования.Вставить("ТребуетсяПроверкаСредствамиККТ", Ложь);
	//- ИнфоСофт Заварин К.В. 13.03.25 УА #96054
	
	РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);
	
	ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода);
	
	//ИС_MP_МаркировкаКлиент.ОбработатьДанныеШтрихкода("ОбработатьШтрихкодыЗавершение", ЭтаФорма, ДанныеШтрихкода);
	//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Данные, ДополнительныеПараметры) Экспорт
	
	Если Данные.Штрихкод <> "" Тогда
		ОбработатьШтрихкоды(СокрЛП(Данные.Штрихкод));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоЗаказы.ЭтикеткаРаспечатана");
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЗаказы.Имя);
	ОформляемоеПоле.Использование = Истина;
	
КонецПроцедуры

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПреобразоватьДеревоВТаблицуЗначений(ДеревоЗначений, ТекущийОбъект)
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Если Строка.Строки.Количество() = 0 Тогда
			
			НоваяСтрока = ТекущийОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
		ИначеЕсли Строка.Строки.Количество() > 0 Тогда
			
			ПреобразоватьДеревоВТаблицуЗначений(Строка, ТекущийОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ЗаполнитьДеревоНоменклатурыПоТЧ()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_УпаковкаТоваровТовары.Заказ КАК Заказ,
		|	ИС_ЯМ_УпаковкаТоваровТовары.Номенклатура КАК Номенклатура,
		|	ИС_ЯМ_УпаковкаТоваровТовары.Характеристика КАК Характеристика,
		|	ИС_ЯМ_УпаковкаТоваровТовары.КоличествоЗаказ КАК КоличествоЗаказ,
		|	ИС_ЯМ_УпаковкаТоваровТовары.КоличествоФакт КАК КоличествоФакт,
		|	ИС_ЯМ_УпаковкаТоваровТовары.ЭтикеткаРаспечатана КАК ЭтикеткаРаспечатана
		|ИЗ
		|	Документ.ИС_ЯМ_УпаковкаТоваров.Товары КАК ИС_ЯМ_УпаковкаТоваровТовары
		|ГДЕ
		|	ИС_ЯМ_УпаковкаТоваровТовары.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(КоличествоЗаказ),
		|	СУММА(КоличествоФакт),
		|	МИНИМУМ(ЭтикеткаРаспечатана)
		|ПО
		|	Заказ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(РезультатЗапроса, "ДеревоЗаказы");
 
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ЗаполнитьДанныеЗаказа()
	
	Если ДеревоЗаказы.ПолучитьЭлементы().Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершениеЗаполнениеТаблицы", ЭтотОбъект);
		ТекстВопроса = "Перезаполнить таблицу? Данные в табличной части будут утеряны.";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьДанныеЗаказаНаСервере();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПоказатьВопросЗавершениеЗаполнениеТаблицы(Результат, Объект) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеЗаказаНаСервере();
	Иначе
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ЗаполнитьДанныеЗаказаНаСервере(МассивЗаказов = Неопределено)
	
	Объект.Товары.Очистить();
	ДеревоЗаказы.ПолучитьЭлементы().Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	//+ ИнфоСофт Заварин К.В. 24.02.25 УА #73904
	"ВЫБРАТЬ
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СтатусыСборочныхЗаданий КАК ИС_ЯМ_СтатусыСборочныхЗаданий
	|ГДЕ
	|	ИС_ЯМ_СтатусыСборочныхЗаданий.Профиль = &Профиль
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.status = ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_СтатусыЗаказов.PROCESSING)
	|	И ИС_ЯМ_СтатусыСборочныхЗаданий.substatus = ЗНАЧЕНИЕ(Перечисление.ИС_ЯМ_ДетальныеСтатусы.READY_TO_SHIP)
	|	И &ОтборЗаказов
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_ЯМ_Заказ_items.Ссылка КАК СборочноеЗадание,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	СУММА(ИС_ЯМ_Заказ_items.count) КАК КоличествоЗаказ,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаркируемыйТовар
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Документ.ИС_ЯМ_Заказ.items КАК ИС_ЯМ_Заказ_items
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ИС_ЯМ_Заказ_items.НоменклатураЯМ = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
	|			И ИС_ЯМ_Заказ_items.Ссылка.Профиль = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль
	|ГДЕ
	|	ИС_ЯМ_Заказ_items.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СборочныеЗадания.Заказ КАК Ссылка
	|			ИЗ
	|				ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_Заказ_items.Ссылка,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.СборочноеЗадание КАК Заказ,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.КоличествоЗаказ КАК КоличествоЗаказ,
	|	0 КАК КоличествоФакт,
	|	""Ложь"" КАК ЭтикеткаРаспечатана,
	|	ВТ_Номенклатура.МаркируемыйТовар КАК МаркируемыйТовар,
	|	ВЫБОР
	|		КОГДА ИС_MP_ДанныеВыгрузкиКИЗов.КоличествоВыгруженныхТоваров = ВТ_Номенклатура.КоличествоЗаказ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаркировкаПередана
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ДанныеВыгрузкиКИЗов КАК ИС_MP_ДанныеВыгрузкиКИЗов
	|		ПО ВТ_Номенклатура.Номенклатура = ИС_MP_ДанныеВыгрузкиКИЗов.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ИС_MP_ДанныеВыгрузкиКИЗов.Характеристика
	|			И ВТ_Номенклатура.СборочноеЗадание = ИС_MP_ДанныеВыгрузкиКИЗов.ЗаказМП
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ
	|ИТОГИ
	|	СУММА(КоличествоЗаказ)
	|ПО
	|	Заказ";
	//- ИнфоСофт Заварин К.В. 24.02.25 УА #73904
	
	Если МассивЗаказов = Неопределено ИЛИ МассивЗаказов.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("ОтборЗаказов", Истина);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗаказов", "ИС_ЯМ_СтатусыСборочныхЗаданий.Заказ В(&МассивЗаказов)");
		Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(РезультатЗапроса, "ДеревоЗаказы");	
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520	

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода)
	
	//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381	
	ДанныеШтрихкода = РезультатОбработкиШтрихкода.ДанныеШтрихкода;	
	//ДанныеШтрихкода = РезультатОбработкиШтрихкода;	
	//- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
	
	РезультатРазбора = РазборКодаМаркировкиНаСервере(ДанныеШтрихкода.НормализованныйШтрихкод);
	
	Если РезультатРазбора <> Неопределено Тогда
		ДанныеШтрихкодаУпаковки = ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора);
		ДанныеШтрихкода = ДанныеШтрихкодаУпаковки;
	Иначе
		ДанныеШтрихкодаУпаковки = Неопределено;
	КонецЕсли;
	
	Если ДанныеШтрихкодаУпаковки = Неопределено И Не ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура) Тогда
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ЗвукШтрихкодОтстутствуетВБазе();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдены данные по коду " + ДанныеШтрихкода.Штрихкод);
		Возврат;		
	КонецЕсли;	
	
	Дерево = ДеревоЗаказы.ПолучитьЭлементы();
	
	ТекущийЗаказ = Неопределено;
	СтрокаДанныеСборки = Неопределено;   
	
	Для Каждого Заказ Из Дерево Цикл
		
		СтрокиЗаказа = Заказ.ПолучитьЭлементы();
		
		Если СтрокиЗаказа.Количество() > 0 Тогда 
			
			Для Каждого Строка Из СтрокиЗаказа Цикл 
				
				Если Строка.Номенклатура = ДанныеШтрихкода.Номенклатура И Строка.Характеристика = ДанныеШтрихкода.Характеристика И Не Строка.ЭтикеткаРаспечатана Тогда
					
					ТекущийЗаказ = Заказ;
					СтрокаДанныеСборки = Строка;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтрокаДанныеСборки <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если СтрокаДанныеСборки = Неопределено Тогда
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762 	 
		ЗвукТоварОтсутствуетВЗаказе();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ОбщегоНазначенияКлиент.СообщитьПользователю("По отсканированному штрихкоду не найдено доступного заказа для печати этикетки.");
		Возврат;
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
	Иначе		
		ЗвукТоварНайден();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
	КонецЕсли;	
	
	ЭтикеткаРаспечатана = Ложь;
	
	СтрокаДанныеСборки.КоличествоФакт = СтрокаДанныеСборки.КоличествоФакт + 1;
	ТекущийЗаказ.КоличествоФакт       = ТекущийЗаказ.КоличествоФакт + 1; 
	
	//+ ИнфоСофт Заварин К.В. 06.11.24 УА #86503
	Элементы.ДеревоЗаказы.ТекущаяСтрока  = СтрокаДанныеСборки.ПолучитьИдентификатор();
	//- ИнфоСофт Заварин К.В. 06.11.24 УА #86503
	
	Если СтрокаДанныеСборки.КоличествоФакт = СтрокаДанныеСборки.КоличествоЗаказ Тогда
		
		НужноПечатать = Истина;
		СтрокаДанныеСборки.ЭтикеткаРаспечатана = Истина;
		
		СтрокиПоЗаказу = ТекущийЗаказ.ПолучитьЭлементы();
		
		Если СтрокиПоЗаказу.Количество() > 1 Тогда
			
			Для Каждого Строка Из СтрокиПоЗаказу Цикл
				
				Если Строка.КоличествоФакт <> Строка.КоличествоЗаказ Тогда				
					НужноПечатать = Ложь;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НужноПечатать Тогда
			
			Попытка
				
				ВыполнитьПечатьЭтикетки(СтрокаДанныеСборки);
				
				//+ ИнфоСофт Заварин К.В. 06.11.24 УА #86503	
				Если ПечататьСостав Тогда
					
					ЗаказДокумент   = ТекущийЗаказ.Заказ;      
					КоличествоОбщее = ТекущийЗаказ.КоличествоЗаказ;		
					Табдок = ВыполнитьПечатьСоставаЗаказа(ЗаказДокумент, КоличествоОбщее);
					Табдок.Напечатать();
				КонецЕсли;
				//- ИнфоСофт Заварин К.В. 06.11.24 УА #86503
				
				ТекущийЗаказ.ЭтикеткаРаспечатана = ЭтикеткаРаспечатана;
				
				Элементы.ДеревоЗаказы.Свернуть(ТекущийЗаказ.ПолучитьИдентификатор());
				
			Исключение
				ОбщегоНазначенияКлиент.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Заварин К.В. 07.11.24 УА #86503
&НаСервере   
Функция ВыполнитьПечатьСоставаЗаказа(ЗаказДокумент, КоличествоОбщее = 0) 
	
	ТаблицаНоменклатуры = ПолучитьТаблицуИзДерева(ЗаказДокумент);
	
	СтруктураСоставаЗаказа = Новый Структура;
	СтруктураСоставаЗаказа.Вставить("НомерЗаказа",	   ЗаказДокумент.Номер);
	СтруктураСоставаЗаказа.Вставить("Дата", 	   	   Формат(ЗаказДокумент.Дата,"ДФ=dd.MM.yyyy"));
	СтруктураСоставаЗаказа.Вставить("КоличествоОбщее", КоличествоОбщее);
	СтруктураСоставаЗаказа.Вставить("СтрокиПоЗаказу",  ТаблицаНоменклатуры); 
	
	
	Табдок = Новый ТабличныйДокумент;
	
	Табдок.ИмяПараметровПечати = "ПФ_MXL_СоставЗаказ";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;  
	ТабДок.АвтоМасштаб = Истина;
	
	МакетОбработки = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_ЯМ_УпаковкаТоваров.ПФ_MXL_СоставЗаказ");
	
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("ШапкаСоставЗаказа");
	
	ОбластьШапка.Параметры.НомерЗаказа 	   = СтруктураСоставаЗаказа.НомерЗаказа;
	ОбластьШапка.Параметры.Дата 	   	   = СтруктураСоставаЗаказа.Дата; 
	ОбластьШапка.Параметры.КоличествоОбщее = СтруктураСоставаЗаказа.КоличествоОбщее;
	
	Табдок.Вывести(ОбластьШапка); 
	
	ВысотаОбластей = Табдок.ВысотаТаблицы;         
	
	Для Каждого Элемент Из СтруктураСоставаЗаказа.СтрокиПоЗаказу Цикл
		
		ОбластьСтроки = МакетОбработки.ПолучитьОбласть("СтрокаСоставЗаказа");
		
		ОбластьСтроки.Параметры.Номенклатура   = Лев(Элемент.Номенклатура, 37) + "...";
		ОбластьСтроки.Параметры.Код	           = Элемент.Номенклатура.Код;
		ОбластьСтроки.Параметры.Характеристика = Элемент.Характеристика;
		ОбластьСтроки.Параметры.Количество     = Элемент.КоличествоЗаказ;
		
		Если ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы >= 24 Тогда 
			Табдок.ВывестиГоризонтальныйРазделительСтраниц();
			
			ОбластьШапка = МакетОбработки.ПолучитьОбласть("ШапкаСоставЗаказа");
			
			ОбластьШапка.Параметры.НомерЗаказа 	   = СтруктураСоставаЗаказа.НомерЗаказа;
			ОбластьШапка.Параметры.Дата 	   	   = СтруктураСоставаЗаказа.Дата; 
			ОбластьШапка.Параметры.КоличествоОбщее = СтруктураСоставаЗаказа.КоличествоОбщее;
			
			Табдок.Вывести(ОбластьШапка); 
			
			ВысотаОбластей = 4;
		Иначе
			ВысотаОбластей = ВысотаОбластей + ОбластьСтроки.ВысотаТаблицы; 	
		КонецЕсли;
			
		Табдок.Вывести(ОбластьСтроки);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.НастройкаПечатиЭтикеток) Тогда 		
		ВыполнитьНастройкуТабличногоДокумента(Табдок, Объект.НастройкаПечатиЭтикеток);			
	КонецЕсли;
	
	Возврат Табдок; 
	
КонецФункции //- ИнфоСофт Заварин К.В. 07.11.24 УА #86503 

//+ ИнфоСофт Заварин К.В. 07.11.24 УА #86503 
&НаСервере
Функция ПолучитьТаблицуИзДерева(Заказ, ТаблицаНоменклатуры = Неопределено)
	
	НомерЗаказа = Заказ.Номер; 
	
	Дерево = ДеревоЗаказы.ПолучитьЭлементы();
	ДеревоЗначение = РеквизитФормыВЗначение("ДеревоЗаказы"); 
	
	Для Каждого Элемент Из Дерево Цикл
		
		Если Элемент.Заказ.Номер = НомерЗаказа Тогда
			
			СтрокиПоЗаказу = Элемент.ПолучитьЭлементы(); 
			
			Если ТаблицаНоменклатуры = Неопределено Тогда
				ТаблицаНоменклатуры = Новый ТаблицаЗначений;
				Для Каждого Колонка Из ДеревоЗначение.Колонки Цикл
					ТаблицаНоменклатуры.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
				КонецЦикла;
			КонецЕсли;
			
			Для Каждого СтрокаДерева Из СтрокиПоЗаказу Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаНоменклатуры.Добавить(), СтрокаДерева);
			КонецЦикла;
			Возврат ТаблицаНоменклатуры;			
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ТаблицаНоменклатуры;	
	
КонецФункции //- ИнфоСофт Заварин К.В. 07.11.24 УА #86503

//+ ИнфоСофт Заварин К.В. 07.11.24 УА #86503
&НаСервере
Процедура ВыполнитьНастройкуТабличногоДокумента(Этикетка, НастройкиПечати)
	
	Этикетка.ИмяПринтера = НастройкиПечати.ИмяПринтера; 
	Этикетка.ПолеСлева = НастройкиПечати.Слева;
	Этикетка.ПолеСправа = НастройкиПечати.Справа;
	Этикетка.ПолеСнизу = НастройкиПечати.Снизу;
	Этикетка.ПолеСверху = НастройкиПечати.Сверху;	
	Этикетка.РазмерКолонтитулаСверху = НастройкиПечати.КолонтитулыСверху;
	Этикетка.РазмерКолонтитулаСнизу = НастройкиПечати.КолонтитулыСнизу; 
	Этикетка.ЭкземпляровНаСтранице = НастройкиПечати.ЭкземпляровНаСтраницу; 
	
	Если НастройкиПечати.ОриентацияСтраницы = 0 Тогда 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Иначе 
		Этикетка.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	
	//+ ИнфоСофт Заварин К.В. 03.12.24 УА #72698
	Если НастройкиПечати.Масштаб = 0 Тогда 
		Этикетка.АвтоМасштаб = Истина;
	Иначе 
		Этикетка.АвтоМасштаб = Ложь;
		Этикетка.МасштабПечати = НастройкиПечати.МасштабЗначение;	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.12.24 УА #72698

	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 07.11.24 УА #86503

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВыполнитьПечатьЭтикетки(СтрокаДанныеСборки) 
	
	МассивЭтикеток = ПолучитьЭтикеткиНаСервере(СтрокаДанныеСборки.Заказ);
	
	Если МассивЭтикеток.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить этикетки с сервера Яндекс Маркет!");
		Возврат;
	КонецЕсли;
	
	Этикетка = МассивЭтикеток[0];
	
	Если ЗначениеЗаполнено(Объект.НастройкаПечатиЭтикеток) Тогда 		
		ПринтерДляПечати = """" + ПолучитьПринтерДляПечати() + """";
	Иначе	
		ПринтерДляПечати = "";
	КонецЕсли;
	
	ИмяКаталогаВременныхФайлов = КаталогВременныхФайлов();
	
	ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + "stickersFile.pdf";

	Этикетка.Записать(ИмяВременногоФайла);
	
	ИС_МП_Клиент.НапечататьИзПриложения(ИмяВременногоФайла, ПринтерДляПечати);
	
	ЭтикеткаРаспечатана = Истина;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьЭтикеткиНаСервере(СборочноеЗадание)

	МассивЗаданий = Новый Массив;
	МассивЗаданий.Добавить(СборочноеЗадание);
	
	Возврат ИС_ЯМ_Сервер.НапечататьЭтикетки(Объект.Профиль, МассивЗаданий);
	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваров.Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", РезультатРазбора.НормализованныйКодМаркировки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Номенклатура", Выборка.Номенклатура);
	Результат.Вставить("Характеристика", Выборка.Характеристика);
	Результат.Вставить("НормализованныйШтрихкод", РезультатРазбора.КодМаркировки); 
	Результат.Вставить("ШтрихкодУпаковки", Выборка.Ссылка);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьПринтерДляПечати()
	Возврат Объект.НастройкаПечатиЭтикеток.ИмяПринтера;	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция РазборКодаМаркировкиНаСервере(НормализованныйШтрихкод)	
	Возврат ИС_MP_Маркировка.РазборКодаМаркировки(НормализованныйШтрихкод);	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381
&НаСервере
Функция ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения = Неопределено)

	Возврат ИС_MP_Маркировка.ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, ЭтаФорма.УникальныйИдентификатор);	
			
КонецФункции //- ИнфоСофт Стояк Ю.К. 29.08.2024 УА #81381

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ПолучитьЗначениеПараметра()
	
	МассивНаименованийПараметров = Новый Массив;  	
	МассивНаименованийПараметров.Добавить("ПроигрыватьЗвукиПриСканировании");
		
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Объект.Профиль, Перечисления.ИС_МП_Маркетплейсы.ЯМ, МассивНаименованийПараметров);
	
	//+ ИнфоСофт Власова И.С. 04.02.25 УА #92991
	//Если Настройки.Свойство("ПроигрыватьЗвукиПриСканировании") Тогда
	Если Настройки.Свойство("ПроигрыватьЗвукиПриСканировании") И Не Настройки.ПроигрыватьЗвукиПриСканировании = Неопределено Тогда
	//- ИнфоСофт Власова И.С. 04.02.25 УА #92991
		Возврат Настройки.ПроигрыватьЗвукиПриСканировании;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762


//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762 
//Реализован функционал воспроизведения дополнительного звука при сканировании товаров в документе "УпаковкаТоваров"
&НаКлиенте
Процедура ПроигратьЗвук(ИмяФайла) 
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	//+ ИнфоСофт Власова И.С. 27.01.25 УА #91984
	//Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
	//	Или Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
		И Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 27.01.25 УА #91984
	
	Константа = ПолучитьЗначениеПараметра(); 
	
	Если Константа Тогда  
		oVoice = Новый COMObject("SAPI.SpVoice");
		oSpFileStream = Новый COMObject("SAPI.SpFileStream");
		oSpFileStream.Open(ИмяФайла);
		oVoice.SpeakStream(oSpFileStream);
		oSpFileStream.Close();
	Иначе
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукТоварНайден()
	
	ИмяФайла = КаталогДокументов() + "scanOK.wav";
	ПроигратьЗвук(ИмяФайла);
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукТоварОтсутствуетВЗаказе()
	
	ИмяФайла = КаталогДокументов() + "scanAlarm.wav";
	ПроигратьЗвук(ИмяФайла); 
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукШтрихкодОтстутствуетВБазе()
	ИмяФайла = КаталогДокументов() + "scanERROR.wav";
	ПроигратьЗвук(ИмяФайла); 	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

#КонецОбласти
